module.exports = [
	{
		subject: {
			title: "ООП",
			url: "../001-oop.md"
		},
		url: "../001-oop.md##Что-такое-инкапсуляция",
		title: "Что такое <i>«инкапсуляция»</i>?",
		answer: "<b>Инкапсуляция<b> – это свойство системы, позволяющее объединить данные и методы, " +
			"работающие с ними, в классе и скрыть детали реализации от пользователя, открыв только то, что " +
			"необходимо при последующем использовании."
	},
	{
		subject: {
			title: "ООП",
			url: "../001-oop.md"
		},
		url: "../001-oop.md#Что-такое-наследование",
		title: "Что такое <i>«наследование»</i>?",
		answer: "<b>Наследование<b> – это свойство системы, позволяющее описать новый класс на основе уже " +
			"существующего с частично или полностью заимствующейся функциональностью."
	}
];